Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh1-6-v3.tmx
Source language: bo
Languages: en

source: །ཀུན་དགའ་བོ་རྒྱལ་པོ་མུ་ཁྱུད་དང་ལྷའི་དབང་པོ་བརྒྱ་བྱིན་སྟན་ཕྱེད་ཕྱེད་ལ་འཁོད་པ་ན་ཁྱད་པར་རམ་བསམ་པའམ་ཐ་དད་དུ་བྱ་བ་མེད་ཀྱི། གཞན་དུ་ན་ལྷའི་དབང་པོ་བརྒྱ་བྱིན་ནི་མིག་འཛུམས་པར་མི་བྱེད་དོ།
en: “Ānanda, when King Nimi and Śakra, Lord of the Gods, sat on the two halves of the same seat, there was no difference, no distinction, and no contrast between them, except that Śakra, Lord of the Gods, did not blink his eyes.

source: །དེ་ནས་ལྷའི་དབང་པོ་བརྒྱ་བྱིན་གྱིས་རྒྱལ་པོ་མུ་ཁྱུད་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: “Thereupon Śakra, Lord of the Gods, said to King Nimi, ‘O Nimi, you should stay here.

source: །མུ་ཁྱུད་འདི་ཉིད་དུ་འདུག་ལ་མུ་ཁྱུད་ཁྱོད་དགའ་བར་སྤྱོད་ཅིག །འདོད་པའི་ཡོན་ཏན་ལྔ་འབྱོར་ཅིང་ལྡན་པ་ལ་རྩེད་མོ་བྱོས་ཤིག །དགའ་བར་སྤྱོད་ཅིག །དགའ་མགུར་སྤྱོད་ཅིག །དེ་ནས་རྒྱལ་པོ་མུ་ཁྱུད་ཀྱིས་དེའི་ཚེ་ཚིགས་སུ་བཅད་དེ་སྨྲས་པ།
en: Nimi, amuse yourself. Play, amuse yourself, and enjoy yourself, enjoying the objects of the five kinds of desires.’ “At that time, King Nimi spoke these verses: “ ‘A place that is Under the rule of others

source: ཇི་ལྟར་སྣོད་དང་ཤིང་རྟ་དག །རེ་ཞིག་དུས་ཀྱི་བརྙན་པོ་ལྟར། །གཞན་དག་དབང་སྒྱུར་གང་ཡིན་པའི།
en: Is like a vessel and a chariot

source: །གནས་ཀྱང་དེ་དང་འདྲ་བ་ཡིན།
en: Borrowed only for a while.

source: །འདི་ནས་མི་ཐི་ལར་སོང་ལ།
en: “ ‘I will return to Mithilā

source: །དགེ་བ་མང་པོ་རྣམས་བྱ་སྟེ།
en: And perform many good deeds.

source: །བསོད་ནམས་བྱས་ཤིང་འབྱོར་བྱས་ནས།
en: Having made merit and attained prosperity,

source: །མཐོ་རིས་སུ་ནི་འགྲོ་བར་བྱ།
en: I will go to heaven.’

source: །ཀུན་དགའ་བོ་དེའི་ཚེ་དེའི་དུས་ན་རྒྱལ་པོ་ལྷ་ཆེན་པོ་ཞེས་བྱ་བ་གང་གིས་དགེ་བའི་ལམ་ངེས་པ་དེ་ལ་ཞུགས་ཤིང་། གང་དགེ་བའི་ལམ་ངེས་པ་ལ་ཞུགས་པ་ལ་བརྟེན་ནས་ལྷ་ཆེན་པོ་བརྒྱད་ཁྲི་བཞི་སྟོང་མི་ཐི་ལའི་ལྷ་ཆེན་པོའི་ཨ་མྲའི་ཚལ་འདི་ཉིད་དུ་རྒྱལ་པོའི་དྲང་སྲོང་གི་ཚངས་པར་སྤྱོད་པ་སྤྱད་པར་གྱུར་པ་བྱུང་བ་གང་ཡིན་པ་དེ་གཞན་ཡིན་པ་སྙམ་དུ་སེམས་ན་ཁྱོད་ཀྱིས་དེ་ལྟར་མི་བལྟའོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: “Ānanda, if you think that the one who was at that time, on that occasion, King Mahādeva, who entered that virtuous and sure path, and after whose entrance onto that virtuous and sure path eighty-four thousand Mahādevas led the pure life of a royal ṛṣi in this very mango grove of Mahādeva in Mithilā, was someone else, you should think otherwise. Why?

source: ཀུན་དགའ་བོ་ང་ཉིད་དེའི་ཚེ་དེའི་དུས་ན་རྒྱལ་པོ་ལྷ་ཆེན་པོ་ཞེས་བྱ་བར་གྱུར་ཏེ། ང་ཉིད་ཀྱིས་དགེ་བའི་ལམ་ངེས་པ་དེ་སྲོལ་བཏོད་ཅིང་དགེ་བའི་ལམ་ངེས་པ་སྲོལ་དོད་པ་ལ་བརྟེན་ནས་ལྷ་ཆེན་པོ་བརྒྱད་ཁྲི་བཞི་སྟོང་གིས་མི་ཐི་ལ་འདི་ཉིད་ན་ལྷ་ཆེན་པོའི་ཨ་མྲའི་ཚལ་འདི་ཉིད་དུ་རྒྱལ་པོའི་དྲང་སྲོང་གི་ཚངས་པར་སྤྱོད་པ་སྤྱད་དོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: “Ānanda, I myself was at that time, on that occasion, King Mahādeva, who introduced that virtuous and sure path, after whose introduction of that virtuous and sure path eighty-four thousand Mahādevas led the pure life of a royal ṛṣi in this very mango grove of Mahādeva in Mithilā. Why?

source: ཀུན་དགའ་བོ་དེའི་ཚེ་ང་འདོད་ཆགས་དང་བཅས། ཞེ་སྡང་དང་བཅས། གཏི་མུག་དང་བཅས་པར་གྱུར་ཏེ།
en: “Ānanda, at that time I had desire, anger, and delusion.

source: སྐྱེ་བ་དང་། རྒ་བ་དང་། ན་བ་དང་། འཆི་བ་དང་། མྱ་ངན་དང་། སྨྲེ་སྔགས་འདོན་པ་དང་། སྡུག་བསྔལ་བ་དང་། ཡིད་མི་བདེ་བ་དང་། འཁྲུག་པ་ལས་ཡོངས་སུ་མ་གྲོལ་ཞིང་སྡུག་བསྔལ་ལས་ཡོངས་སུ་མ་གྲོལ་ལོ་ཞེས་གསུང་ངོ་།
en: I had not been liberated from birth, old age, illness, death, sorrow, lamentation, pain, despair, and distress. I had not been liberated from suffering,” said the Blessed One.

source: །ཀུན་དགའ་བོ་ད་ནི་ང་འཇིག་རྟེན་དུ་སྟོན་པ་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིག་པ་དང་ཞབས་སུ་ལྡན་པ། བདེ་བར་གཤེགས་པ། འཇིག་རྟེན་མཁྱེན་པ། སྐྱེས་བུ་འདུལ་བའི་ཁ་ལོ་སྒྱུར་བ། བླ་ན་མེད་པ།
en: “Ānanda, now I, after appearing in this world as a teacher, a tathāgata, an arhat, a perfectly awakened one, perfect in knowledge and conduct, a sugata, a world-knowing, supreme tamer of people to be tamed, a teacher of gods and humans, a buddha, and a blessed one, have become free from desire, anger, and delusion.

source: ལྷ་དང་མི་རྣམས་ཀྱི་སྟོན་པ། སངས་རྒྱས་བཅོམ་ལྡན་འདས་སུ་བྱུང་ནས་འདོད་ཆགས་དང་བྲལ། ཞེ་སྡང་དང་བྲལ། གཏི་མུག་དང་བྲལ་བས་སྐྱེ་བ་དང་། རྒ་བ་དང་། ན་བ་དང་། འཆི་བ་དང་། མྱ་ངན་དང་། སྨྲེ་སྔགས་འདོན་པ་དང་། སྡུག་བསྔལ་བ་དང་། ཡིད་མི་བདེ་བ་དང་། འཁྲུག་པ་ལས་ཡོངས་སུ་གྲོལ་ཞིང་སྡུག་བསྔལ་ལས་ཡོངས་སུ་གྲོལ་ལོ་ཞེས་གསུང་ངོ་།
en: Thus I have been liberated from birth, old age, illness, death, sorrow, lamentation, pain, despair, and distress,” said the Blessed One.

source: །ཀུན་དགའ་བོ་ད་ལྟར་ན་ཡང་ངས་དགེ་བའི་ལམ་ངེས་པ་སྲོལ་བཏོད་པ་དེ་ལ་བརྟེན་ནས་སེམས་ཅན་སྐྱེ་བའི་ཆོས་ཅན་རྣམས་ནི་སྐྱེ་བའི་ཆོས་ཉིད་ལས་ཡོངས་སུ་གྲོལ་བར་འགྱུར།
en: “Ānanda, now I, depending on that virtuous and sure path introduced by me, will liberate beings, who are by nature subject to birth, from being by nature subject to birth.

source: སེམས་ཅན་རྒ་བ་དང་། ན་བ་དང་། འཆི་བ་དང་། མྱ་ངན་དང་། སྨྲེ་སྔགས་འདོན་པ་དང་། སྡུག་བསྔལ་བ་དང་། ཡིད་མི་བདེ་བ་དང་། འཁྲུག་པའི་ཆོས་ཅན་རྣམས་ནི་འཁྲུག་པའི་ཆོས་ཉིད་ལས་ཡོངས་སུ་གྲོལ་བར་འགྱུར།
en: I will liberate beings, who are by nature subject to old age, illness, death, sorrow, lamentation, pain, despair, and distress, from being by nature subject to . . . distress.

source: ངས་དགེ་བའི་ལམ་ངེས་པ་ལ་ཞུགས་ཤིང་དགེ་བའི་ལམ་ངེས་པ་ལ་ཞུགས་པ་དེ་ལ་བརྟེན་ནས་སེམས་ཅན་སྐྱེ་བའི་ཆོས་ཅན་ནས་སེམས་ཅན་འཁྲུག་པའི་ཆོས་ཅན་གྱི་བར་དག་འཁྲུག་པའི་ཆོས་ཉིད་ལས་ཡོངས་སུ་གྲོལ་བར་འགྱུར་བ་དེ་གང་ཡིན་ཞེ་ན་འདི་ལྟ་སྟེ།
en: What is that virtuous and sure path onto which I entered, on which I depended, and by which I will liberate beings, who are by nature subject to birth . . . distress, from being by nature subject to . . . distress?

source: འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་ཡིན་ཏེ། འདི་ལྟ་སྟེ། ཡང་དག་པའི་ལྟ་བ་དང་། ཡང་དག་པའི་རྟོག་པ་དང་། ཡང་དག་པའི་ངག་དང་། ཡང་དག་པའི་ལས་ཀྱི་མཐའ་དང་། ཡང་དག་པའི་འཚོ་བ་དང་། ཡང་དག་པའི་རྩོལ་བ་དང་། ཡང་དག་པའི་དྲན་པ་དང་། ཡང་དག་པའི་ཏིང་ངེ་འཛིན་ཏེ།
en: It is the eightfold path of the noble ones, namely, right view, right thought, right speech, right behavior, right livelihood, right effort, right mindfulness, and right meditation.

source: འདི་ནི་ངས་དགེ་བའི་ལམ་ངེས་པ་ལ་ཞུགས། དགེ་བའི་ལམ་ངེས་པ་ལ་ཞུགས་པ་དེ་ལ་བརྟེན་ནས་སེམས་ཅན་སྐྱེ་བའི་ཆོས་ཅན་ནས་གོང་མ་བཞིན་དུ་འཁྲུག་པའི་ཆོས་ཉིད་ལས་ཡོངས་སུ་གྲོལ་བར་འགྱུར་བའི་བར་ཡིན་ནོ།
en: This is that virtuous and sure path onto which I entered, on which I depended, and by which I will liberate beings, who are by nature subject to birth . . . distress, from being by nature subject to . . . distress.

source: །ཀུན་དགའ་བོ་ཁྱོད་ཀྱིས་ཀྱང་དེ་བཞིན་དུ་དགེ་བའི་ལམ་ངེས་པ་སྲོལ་དོད་པ་དེ་ལྟ་བུའི་རྗེས་བསབ་པར་བྱའི་རྒྱུན་ཆད་པར་མ་བྱེད་ཅིག །སྐྱེས་བུ་ཐ་ཤལ་དུ་གྱུར་པར་མ་བྱེད་ཅིག །ཀུན་དགའ་བོ་གང་ལ་ལ་དེ་ལྟ་བུའི་ཉན་ཐོས་བཟང་པོ་རྒྱུད་དུ་བྱུང་བའི་དགེ་བའི་ལམ་ངེས་པ་སྲོལ་དོད་པ་དེ་ལྟ་བུའི་རྗེས་མི་འཚོབ་པ་དེ་ནི་དེ་རྣམས་ཀྱི་རྒྱུན་གཅོད་པ་ཡིན་ཞིང་། དེ་དེ་རྣམས་ཀྱི་སྐྱེས་བུ་ཐ་ཤལ་དུ་གྱུར་པ་ཡིན་ནོ།
en: “Ānanda, you should also thus complete this virtuous and sure path introduced by me and you should not break the tradition. Do not be an inferior man. “Ānanda, he who does not allow such a virtuous and sure path of good disciples born to a noble lineage to increase, once introduced, will be the one who breaks their tradition and an inferior man among them.

source: །དེ་བས་ན་ང་ཁྱོད་ལ་འདི་སྐད་དུ་ཅི་ནས་ཀྱང་ཁྱོད་ཀྱིས་དེ་ལྟ་བུའི་ཉན་ཐོས་བཟང་པོ་རྒྱུད་དུ་བྱུང་བའི་ལམ་ངེས་པ་སྲོལ་དོད་པ་དེ་ལྟ་བུ་དེའི་རྗེས་སོབས་ཤིག །རྒྱུན་ཆད་པར་མ་བྱེད་ཅིག །སྐྱེས་བུ་ཐ་ཤལ་དུ་གྱུར་པར་མ་བྱེད་ཅིག་ཅེས་སྨྲའོ།
en: Therefore, I said, ‘Complete such a virtuous and sure path of good disciples born to a noble lineage that has been introduced by me. Do not break the tradition. Do not be an inferior man.’ ” IV. Videha

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་ལ་བཀའ་སྩལ་པ། ཀུན་དགའ་བོ་ལུས་འཕགས་གང་ན་བ་དེར་འདོང་ངོ་།
en: Thereupon the Blessed One said to the venerable Ānanda, “Ānanda, let us go to Videha.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ལུས་འཕགས་སུ་བྱོན་ནས་ལུས་འཕགས་ཀྱི་ཕྱོགས་གཞན་ཞིག་ཏུ་འཛུམ་པ་མཛད་དོ་ཞེས་བྱ་བ་ནས་སངས་རྒྱས་བཞིའི་གདན་ཡིན་ནོ་ཞེས་བྱ་བ་དང་། སྐད་ཅིག་གཅིག་བཞུགས་ནས་ཞེས་བྱ་བ་རྒྱས་པར་གོང་མ་བཞིན་ནོ།
en: Thereupon the Blessed One, having arrived in Videha, smiled in a certain place in Videha . . . the seat of four buddhas . . . .

source: །ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་ལ་བཀའ་སྩལ་པ། ཀུན་དགའ་བོ་ས་ལ་གང་ན་བར་འདོང་ངོ་།
en: After sitting for a moment, he said to the venerable Ānanda, “Ānanda, let us go to Sālā.”

source: །བཙུན་པ་བཀའ་བཞིན་འཚལ་ཞེས་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོས་བཅོམ་ལྡན་འདས་ཀྱི་ལྟར་མཉན་ནས་བཅོམ་ལྡན་འདས་སྤོང་བྱེད་ནས་ལྗོངས་རྒྱུ་ཞིང་གཤེགས་པ་དང་ས་ལར་བྱོན་ནས་ས་ལའི་བྲམ་ཟེའི་གྲོང་ན་བཞུགས་སོ།
en: “Certainly, O Honored One,” replied the venerable Ānanda to the Blessed One. V. Sālā The Blessed One, traveling through the country of Vṛji, arrived in Sālā and stayed near a village of brahmins there.

source: །དེ་ནས་བཅོམ་ལྡན་འདས་སྔ་དྲོ་ན་བཟའ་ཤམ་ཐབས་མནབས། ལྷུང་བཟེད་དང་ཆོས་གོས་བསྣམས་ཏེ་ས་ལར་བསོད་སྙོམས་ལ་ཞུགས་སོ།
en: Then, early in the morning, the Blessed One dressed, took his bowl and his robe, and entered Sālā for alms.

source: །དེ་ནས་བདུད་སྡིག་ཅན་འདི་སྙམ་དུ་སེམས་ཏེ།
en: Māra the Evil One then had a thought:

source: དགེ་སྦྱོང་གཽ་ཏ་མ་འདི་ས་ལའི་བྲམ་ཟེའི་གྲོང་ན་འདུག་སྟེ།
en: “This śramaṇa Gautama stayed near a village of brahmins in Sālā.

source: དེ་སྔ་དྲོ་ཤམ་ཐབས་བགོས། ལྷུང་བཟེད་དང་ཆོས་གོས་ཐོགས་ཏེ་ས་ལར་བསོད་སྙོམས་ལ་ཞུགས་ཀྱིས།
en: Early in the morning he dressed, took his bowl and his robe, and entered Sālā for alms.

source: མ་ལ་བདག་གིས་ས་ལའི་བྲམ་ཟེ་དང་ཁྱིམ་བདག་རྣམས་ཇི་ལྟར་དགེ་སྦྱོང་གཽ་ཏ་མས་ཇི་ལྟར་ལྷུང་བཟེད་བཀྲུས་ཏེ་ས་ལར་བསོད་སྙོམས་ལ་ཞུགས་པ་བཀྲུས་པ་དེ་ཁོ་ན་བཞིན་བསོད་སྙོམས་ཁམ་འགའ་ཡང་མ་རྙེད་པར་ཕྱིར་ལྡོག་པ་དེ་ལྟ་དེ་ལྟར་བྱིན་གྱིས་བརླབ་བོ་སྙམ་མོ།
en: Now I will exercise my magical power over the brahmins and householders in Sālā so that after the śramaṇa Gautama has entered Sālā for alms, carrying his washed bowl with him, he will return with his bowl as it is, without getting even a scrap of food.”

source: །དེ་ནས་བདུད་སྡིག་ཅན་གྱིས་ས་ལའི་བྲམ་ཟེ་དང་ཁྱིམ་བདག་རྣམས་ཇི་ལྟར་བཅོམ་ལྡན་འདས་ཀྱིས་ཇི་ལྟར་ལྷུང་བཟེད་བཀྲུས་ཏེ་ས་ལར་བསོད་སྙོམས་ལ་ཞུགས་པ་བཀྲུས་པ་དེ་ཁོ་ན་བཞིན་དུ་བསོད་སྙོམས་ཁམ་འགའ་ཡང་མ་རྙེད་པར་སླར་བྱོན་པ་དེ་ལྟ་དེ་ལྟར་བྱིན་གྱིས་བརླབས་སོ།
en: Thereupon Māra the Evil One exercised his magical power over the brahmins and householders in Sālā so that after the Blessed One entered Sālā for alms, carrying his washed bowl with him, he would return with his bowl as it was, without getting even a scrap of food.

source: །དེ་ནས་བདུད་སྡིག་ཅན་གྱིས་བདག་ཉིད་བྲམ་ཟེའི་ཁྱེའུའི་ཆ་བྱད་དུ་མངོན་པར་སྤྲུལ་ནས་བཅོམ་ལྡན་འདས་ཀྱི་རྗེས་བཞིན་དུ་འབྲང་ཞིང་འདི་སྐད་ཅེས་ཀྱང་སྨྲས་སོ། །དགེ་སྦྱོང་དགེ་སྦྱོང་བསོད་སྙོམས་ཁམ་འགའ་ཡང་མ་རྙེད་དམ།
en: Māra the Evil One then transformed himself into a young brahmin, followed the Blessed One, and said, “O śramaṇa, O śramaṇa, did you not even get a scrap of food?”

source: དེ་ནས་བཅོམ་ལྡན་འདས་འདི་སྙམ་དུ་དགོངས་ཏེ། ཀྱེ་མ་ཉེ་བར་འོངས་པ་འདི་ནི་བདུད་སྡིག་ཅན་ཡིན་ཏེ།
en: “Ah,” thought the Blessed One, “this one who is coming is Māra the Evil One.

source: འདི་ལྟ་སྟེ་རྣམ་པར་དཀྲུག་པའི་ལས་བྱེད་དོ་སྙམ་དུ་ཐུགས་སུ་ཆུད་ནས་ཚིགས་སུ་བཅད་དེ་བཀའ་སྩལ་པ།
en: He is causing a disturbance.” Knowing this, he spoke a verse:

source: དེ་བཞིན་གཤེགས་ལ་ཁྱད་བསད་པས།
en: “Through despising the Tathāgata,

source: །ཁྱོད་ཀྱིས་བསོད་ནམས་མིན་མང་བསགས།
en: You accumulated great demerit.

source: །སངས་རྒྱས་རྣམས་ནི་བརྒལ་དཀའ་བར།
en: Buddhas are difficult to surpass.

source: །སྡིག་ཅན་ཅི་ག་མི་ཤེས་སམ།
en: Evil One, do you not know that?”

source: །དགེ་སྦྱོང་དེའི་ཕྱིར་སླར་ཡངས་ལར་བསོད་སྙོམས་ལ་བཞུད་ཅིག་དང་ཅི་ནས་ཀྱང་བསོད་སྙོམས་རྙེད་པ་དེ་ལྟར་བགྱིའོ།
en: Māra the Evil One said, “Śramaṇa, then go to Sālā for alms again, and I will try to ensure that you get alms.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་དེའི་ཚེ་ཚིགས་སུ་བཅད་དེ་བཀའ་སྩལ་པ།
en: Then, at that time, the Blessed One spoke these verses:

source: ང་ལ་ཅི་ཡང་མི་བདོག་པ།
en: “There is nothing for me to take possession of.

source: །ཀྱེ་མ་ཤིན་ཏུ་བདེར་འཚོ་སྟེ།
en: Ah, I abide in utter bliss.

source: །འོད་གསལ་ལྷ་རྣམས་ཇི་ལྟ་བར།
en: Like the gods of Clear Light,

source: །དགའ་བ་ཡི་ནི་ཟས་བཟའོ།
en: I eat pleasure as food.

source: །ང་ལ་ཅི་ཡང་མི་བདོག་པ།
en: “There is nothing for me to take possession of.

source: །འཇིག་ཚོགས་ལྟ་ལ་མི་རྟེན་པས།
en: Since I do not rely on the false view of individuality,

source: །དེ་ནས་བདུད་སྡིག་ཅན་འདི་སྙམ་དུ་སེམས་ཏེ། དགེ་སྦྱོང་གཽ་ཏ་མའི་སེམས་ཀྱིས་བདག་གི་བསམ་པ་ཤེས་སོ་སྙམ་དུ་རིག་ནས་སྡུག་བསྔལ་དང་ཡིད་མི་བདེ་བ་དང་འགྱོད་པས་དེ་ཉིད་དུ་མི་སྣང་བར་གྱུར་ཏོ།
en: Thereupon Māra the Evil One thought, “Śramaṇa Gautama knows my mind.” Knowing this, he disappeared from that very place in pain, despair, and regret. VI.

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་ལ་བཀའ་སྩལ་པ། ཀུན་དགའ་བོ་ཁྲོན་པ་ཅན་གང་ན་བར་འདོང་ངོ་།
en: The Well Then the Blessed One said to the venerable Ānanda, “Ānanda, let us go to Where There Is a Well.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཁྲོན་པ་ཅན་དུ་བྱོན་ཏོ།
en: Soon after the Blessed One arrived at the place called Where There Is a Well.

source: །ཁྲོན་པ་ཅན་ན་བུད་མེད་གཞན་ཞིག་ཕྱང་ཐག་དང་ཆུ་དང་ཆུ་སྣོད་ཁྱེར་ཏེ་ཁྲོན་པའི་དྲུང་དུ་སོང་བ་དང་། སྐྱེས་པ་གཞན་ཞིག་དེ་ལ་ཆགས་པའི་ཀུན་ནས་དཀྲིས་པའི་སེམས་ཀྱིས་རྗེས་བཞིན་རྗེས་བཞིན་དུ་འབྲང་བ་དང་། དེ་ཡང་ལྷག་པར་དེ་ལ་ཆགས་པས་དེ་གཉིས་ཕན་ཚུན་དུ་འཐམ་ཞིང་ཁྲོན་པར་དོང་ངོ་།
en: In Where There Is a Well, a woman went to the well, carrying with her a rope and pitcher. A man followed her, entirely possessed by passion for her. Since she was also extremely passionate about him, the two of them went to the well together, embracing each other.

source: །དེའི་བུ་ཁྱེའུ་ཆུང་ངུ་མ་ཞིག་དེ་དང་ལྷན་ཅིག་ཕྱི་བཞིན་འབྲང་ཞིང་སོང་ངོ་།
en: Her little son also went to the well, following her.

source: །དེ་ནས་དེ་སྐྱེས་པ་ལ་རྟོག་ཅིང་ཆུ་སྣོད་གཏང་ངོ་སྙམ་སྟེ། ཁྱེའུ་ཆུང་ངུ་དེའི་མགུལ་ནས་ཐག་པས་བཏགས་ཏེ་བཏང་བ་ལས་ཤི་བར་གྱུར་ཏོ།
en: Then, preoccupied by the man, she thought, “I will throw the pitcher into the well,” and, tying the rope around her little son’s neck, threw him into the well. The child died.

source: །དེས་སྔོན་མ་ཐོས་པའི་ཚིགས་སུ་བཅད་པ་ཐོས་པ།
en: She then heard a verse that had not been heard before:

source: འདོད་པ་ཁྱོད་རྩ་ངས་ཤེས་ཏེ།
en: “Desire, I know your root.

source: །རྟོག་པ་ལས་ནི་འདོད་པ་སྐྱེ།
en: Desire grows from thought.

source: །ཁྱོད་ལ་རྟོག་པ་མ་བྱས་དང་། །དེ་ནས་ང་ལ་མི་འབྱུང་ངོ་།
en: If I do not think of you, Then you do not arise in me.”

source: །བཅོམ་ལྡན་འདས་ཀྱང་ལམ་དེ་ནས་གཤེགས་ཏེ། དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་ལ་བཀའ་སྩལ་པ།
en: The Blessed One was also walking along the same path, and he said to the venerable Ānanda, “Ānanda, bear this verse in mind.

source: ཀུན་དགའ་བོ་ཚིགས་སུ་བཅད་པ་འདི་ཟུང་ཤིག །ཚིགས་སུ་བཅད་པ་འདི་ནི་འདས་པའི་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀྱིས་གསུངས་པ་ཡིན་ཏེ།
en: This verse was spoken by a perfectly awakened one of the past.

source: འདི་ནི་སོ་སོའི་སྐྱེ་བོའི་ལག་ཏུ་འོངས་པས་མི་སྣང་མི་གསལ། རྣམ་པར་མི་གསལ་ལོ།
en: Since it has come into the hands of an ordinary person, it is not bright, clear, or vivid.”

source: །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ངས་ཇི་ལྟར་སེམས་འདི་མྱུར་དུ་འགྱུར་བ་དེ་ལྟ་བུའི་ཆོས་ནི་གཅིག་ཀྱང་མ་མཐོང་ངོ་།
en: The Blessed One added, “I see nothing that changes as quickly as this mind.”

source: །དེ་ནས་བུད་མེད་དེ་བུའི་མྱ་ངན་གྱིས་གདུང་ནས་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་གཉིས་ལ་གཏུགས་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱིས་དེའི་བསམ་པ་དང་། བག་ལ་ཉལ་དང་། ཁམས་དང་། རང་བཞིན་མཁྱེན་ནས་དེ་དང་མཐུན་པའི་ཆོས་བཤད་པ་མཛད་དེ།
en: The woman, out of sorrow for her son, threw herself at the feet of the Blessed One. The Blessed One knew her thinking, proclivity, disposition, and nature, and preached the Dharma that was appropriate for her.

source: དེ་ཐོས་པས་བུད་མེད་དེས་འཇིག་ཚོགས་ལ་ལྟ་བའི་རིའི་རྩེ་མོ་ཉི་ཤུ་མཐོ་བ་ཡེ་ཤེས་ཀྱི་རྡོ་རྗེས་བཅོམ་ནས་རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུ་མངོན་སུམ་དུ་བྱས་ཏེ།
en: When she had heard the Dharma, the woman leveled the twenty high peaks of the mountain chain of the false view of individuality with the vajra of knowledge and actualized the fruit of stream-entry.

source: བདེན་པ་མཐོང་ནས་ལན་གསུམ་དུ་ཆེད་དུ་བརྗོད་པས་ཆེད་དུ་བརྗོད་པ།
en: After having seen the truths, she spoke an inspired utterance three times:

source: བཙུན་པ་བདག་ལ་འདི་ལྟ་བུ་ནི་མས་མ་བགྱིས་ཏེ། ཕས་མ་ལགས། རྒྱལ་པོས་མ་ལགས། ལྷ་རྣམས་ཀྱིས་མ་ལགས། སྔ་མ་འདས་པ་རྣམས་ཀྱིས་མ་ལགས། དགེ་སྦྱོང་དང་བྲམ་ཟེ་རྣམས་ཀྱིས་མ་ལགས།
en: “O Honored One, what the Blessed One has done for me is what has never been done for me by my mother, my father, a king, gods, ancestral spirits, śramaṇas, brahmins, my husband, or my kinsmen or relatives.

source: སྡུག་པས་མ་ལགས། རང་གི་སྐྱེ་བོ་དང་གཉེན་གྱི་ཚོགས་ཀྱིས་མ་ལགས་པ་གང་ལགས་པ་བཅོམ་ལྡན་འདས་ཀྱིས་བདག་ལ་མཛད་དེ། བདག་གིས་དགེ་བའི་བཤེས་གཉེན་བཅོམ་ལྡན་འདས་ལ་བརྟེན་ནས་ངན་སོང་རྣམས་ཀྱི་སྒོ་ནི་བཀུམ། མཐོ་རིས་དང་ཐར་པའི་སྒོ་རྣམས་ནི་ཕྱེ།
en: Relying on a good spiritual friend, the Blessed One, I have shut the gate to inferior states of existence and opened the gate to heaven and liberation;

source: སེམས་ཅན་དམྱལ་བ་དང་། དུད་འགྲོ་དང་། ཡི་དགས་ནས་ནི་རྐང་པ་དྲངས།
en: pulled myself out from the states of hell, animals, and hungry ghosts and placed myself among the gods and humans;

source: ལྷ་དང་མི་རྣམས་སུ་ནི་རབ་ཏུ་བཞག །འཁོར་བ་ལས་ནི་ཐག་བསྲིངས།
en: left the course of rebirth far behind;

source: །ཁྲག་དང་མཆི་མའི་རྒྱ་མཚོ་ནི་བསྐམས།
en: dried up the ocean of blood and tears;

source: རུས་པའི་རི་བོ་ལས་ནི་བསྒྲལ།
en: and been liberated the mountain of bones.

source: ཐོག་མ་མེད་པའི་དུས་ནས་བསགས་པའི་འཇིག་ཚོགས་ལ་ལྟ་བའི་རིའི་རྩེ་མོ་ཉི་ཤུ་མཐོ་བ་ནི་ཡེ་ཤེས་ཀྱི་རྡོ་རྗེས་བཅོམ་ནས་རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུ་མངོན་སུམ་དུ་བགྱིས་ཏེ།
en: With the vajra of knowledge I have leveled the twenty high peaks of the mountain chain of the false view of individuality that had been accumulated since beginningless time, and actualized the fruit of stream-entry.

source: །བདག་བཅོམ་ལྡན་འདས་དང་། ཆོས་དང་། དགེ་སློང་གི་དགེ་འདུན་ལ་སྐྱབས་སུ་མཆི་ལགས་ཀྱིས། བདག་དགེ་བསྙེན་དུ་གཟུང་དུ་གསོལ།
en: Since I seek refuge in the Blessed One, the Dharma, and the community of monks, please accept me as a lay sister.

source: དེང་སླན་ཆད་ཇི་སྲིད་འཚོའི་བར་དུ་སྲོག་དང་ཡང་བསྔོས་ཏེ་སྐྱབས་སུ་མཆི་བར་མངོན་པར་དད་ལགས་སོ།
en: From today onward, I embrace my faith as one who seeks refuge throughout my life.” VII. Bhārgava

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་ལ་བཀའ་སྩལ་པ། ཀུན་དགའ་བོ་ང་བྱང་ཆུབ་སེམས་དཔར་གྱུར་པ་ན་ཕྱོགས་འདི་ཉིད་དུ་དྲང་སྲོང་ངན་སྤོང་གི་བུས་གདན་དང་རྩ་བ་དང་འབྲས་བུ་ལ་སྤྱན་དྲངས་སོ།
en: In a certain place, the Blessed One said to the venerable Ānanda, “Ānanda, when I was a bodhisattva, in this place I was given an invitation by the ṛṣi Bhārgava with a seat, roots, and fruits.” VIII. Kāṣāya

source: །ཕྱོགས་གཞན་ཞིག་ཏུ་ཡང་བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཀུན་དགའ་བོ་ང་བྱང་ཆུབ་སེམས་དཔར་གྱུར་པ་ན་རྒ་བ་ལ་སོགས་པས་ཡིད་བྱུང་སྟེ། ཕྱོགས་འདི་ཉིད་དུ་ལྷའི་དབང་པོ་བརྒྱ་བྱིན་རྔོན་པའི་ཆ་བྱད་དུ་བྱས་པ་ལ་ཀ་ཤི་ཀའི་རས་ཕྲན་བྱིན་ནས་གོས་ངུར་སྨྲིག་བླངས་པ་ཡིན་ཏེ།
en: Again, in a certain place the Blessed One said, “Ānanda, when I was a bodhisattva, I was in despair over old age, and so forth, and in this very place I gave my garment made in Kāśi to Śakra, Lord of the Gods, who was dressed as a hunter, and received saffron (kāṣāya) robes in return.

source: བྲམ་ཟེ་དང་ཁྱིམ་བདག་དད་པ་ཅན་རྣམས་ཀྱིས་ངུར་སྨྲིག་བླངས་པ་ཞེས་བྱ་བའི་མཆོད་རྟེན་བརྩིགས་ཏེ།
en: Devout brahmins and householders built a shrine called Acceptance of the Saffron Robes.

source: ད་དུང་དུ་ཡང་དགེ་སློང་མཆོད་རྟེན་ལ་ཕྱག་འཚལ་བ་དག་ཕྱག་བྱེད་དོ།
en: Today, there are monks who still worship at the shrine there.

source: །ལྷའི་དབང་པོ་བརྒྱ་བྱིན་གྱིས་ཀྱང་ཀ་ཤི་ཀའི་རས་ཕྲན་སུམ་བཅུ་རྩ་གསུམ་པའི་ལྷའི་ནང་དུ་ཁྱེར་ཏེ་བཞག་ནས་ཀ་ཤི་ཀའི་དུས་མཆོད་ཆེན་པོ་བཙུགས་ཏེ།
en: Śakra, Lord of the Gods, having taken the garment made in Kāśi to the Thirty-Three Gods and placed it among them, held a festival for the garment made in Kāśi.

source: ད་དུང་དུ་ཡང་དེ་ལ་སུམ་བཅུ་རྩ་གསུམ་པའི་ལྷ་དག་བྱ་བ་བྱེད་དོ།
en: Today the Thirty-Three Gods still worship it.” IX. Crown of the Head

source: །ཕྱོགས་གཞན་ཞིག་ཏུ་ཡང་བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཀུན་དགའ་བོ་ང་བྱང་ཆུབ་སེམས་དཔར་གྱུར་པ་ན་ཕྱོགས་འདིར་རལ་གྲི་ཨུཏྤ་ལ་སྔོན་པོ་འདྲ་བས་དབུ་སྐྲ་བྲེགས་ནས་སྟེང་གི་ནམ་མཁའ་ལ་འཕངས་པ་ཡིན་ཏེ།
en: Again, in a certain place the Blessed One said, “Ānanda, when I was a bodhisattva, in this place I cut my hair with a sword as if it were a blue utpala petal, and threw the hair up in the air.

source: བྲམ་ཟེ་དང་ཁྱིམ་བདག་དད་པ་ཅན་རྣམས་ཀྱིས་དབུ་སྐྲ་བླངས་པ་ཞེས་བྱ་བའི་མཆོད་རྟེན་བརྩིགས་ཏེ།
en: Devout brahmins and householders built a shrine called Acceptance of the Hair.

source: །ལྷའི་དབང་པོ་བརྒྱ་བྱིན་གྱིས་ཀྱང་དབུ་སྐྲ་སུམ་བཅུ་རྩ་གསུམ་པའི་ལྷའི་ནང་དུ་ཁྱེར་ཏེ་བཞག་ནས་གཙུག་ཕུད་ཀྱི་དུས་མཆོད་ཆེན་པོ་བཙུགས་ཏེ།
en: Śakra, Lord of the Gods, having taken the hair to the Thirty-Three Gods and placed it among them, held a festival for the hair knot.

source: ད་དུང་དུ་ཡང་དེ་ལ་སུམ་བཅུ་རྩ་གསུམ་པའི་ལྷ་རྣམས་བྱ་བ་བྱེད་དོ།
en: Today the Thirty-Three Gods still worship it.” X.

source: །ཕྱོགས་གཞན་ཞིག་ཏུ་ཡང་བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཀུན་དགའ་བོ་ཕྱོགས་འདིར་རྟའི་རྒྱལ་པོ་བསྔགས་ལྡན་འདུན་པས་བཀྲི་ནས་སླར་བཏང་བ་ཡིན་ཏེ།
en: Kanthaka Again, in a certain place the Blessed One said, “Ānanda, Kanthaka, the king of horses, led by Chandaka, turned back from this place.

source: བྲམ་ཟེ་དང་ཁྱིམ་བདག་དད་པ་ཅན་རྣམས་ཀྱིས་བསྔགས་ལྡན་སླར་བཏང་བ་ཞེས་བྱ་བའི་མཆོད་རྟེན་བརྩིགས་ཏེ། ད་དུང་དུ་ཡང་དགེ་སློང་མཆོད་རྟེན་ལ་ཕྱག་འཚལ་བ་དག་ཕྱག་བྱེད་དོ།
en: Devout brahmins and householders built a shrine called Kanthaka’s Return. Today, there are monks who still worship at the shrine there.” XI. Gośālaka

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཡུལ་གནག་ལྷས་ཅན་དུ་བྱོན་ནས་དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་ལ་བཀའ་སྩལ་པ། ཀུན་དགའ་བོ་གནག་ལྷས་ཅན་འདིར་རིགས་ཀྱི་བུ་འདུན་པ་བཙས་ནས་འདི་ཉིད་དུ་ཆེན་པོར་གྱུར་ཏོ།
en: The Blessed One arrived in the country of Gośālaka, and then said to the venerable Ānanda, “Ānanda, Chandaka, the son of a noble family, was born and grew up here in Gośālaka.” XII.

source: །དེ་ནས་བཅོམ་ལྡན་འདས་སྡིག་ཅན་དུ་བྱོན་ཏེ།
en: Pāpā The Blessed One then arrived in Pāpā.

source: སྡིག་ཅན་གྱི་གྱད་རྣམས་ཀྱིས་བཅོམ་ལྡན་འདས་སྡིག་ཅན་དུ་གཤེགས་སོ་ཞེས་ཐོས་སོ། །ཐོས་ནས་ཀྱང་རྒན་རབས་རྒན་རབས་རྣམས་ཀྱིས་སྨྲས་པ།
en: When the people of the Malla clan in Pāpā heard that the Blessed One had arrived in Pāpā, the elder members said, “The young men should clean up the road.

source: གཞོན་ནུ་གང་ཡིན་པ་དེ་དག་གིས་ནི་ལམ་བཟང་པོར་བྱོས་ཤིག །བདག་ཅག་གིས་ནི་གྲོང་ཁྱེར་བཟང་པོར་བྱའོ།
en: We will clean up the city.”

source: །དེ་ནས་གཞོན་ནུ་རྣམས་ཀྱིས་ལམ་བཟང་པོར་བྱ་བར་བརྩམས་པ་ན།
en: Then, when the young men began to clean up the road, they saw a huge rock.

source: དེ་རྣམས་ཀྱིས་ཕ་བོང་ཞིག་མཐོང་ནས་དེ་རྣམས་ཀྱིས་དེ་དོར་བར་བརྩམས་པ་ལས་དོར་བར་མ་ནུས་སོ།
en: They attempted to remove it, but they were unable to.

source: །བཅོམ་ལྡན་འདས་ཀྱང་ཕྱོགས་དེ་ཉིད་དུ་གཤེགས་ནས་བཀའ་སྩལ་པ། གནས་འཇོག་དག་འདི་ཅི་བྱ།
en: The Blessed One also came to that place and asked them, “Vāsiṣṭhas, what are you doing?”

source: བཅོམ་ལྡན་འདས་ཀྱི་སླད་དུ་ཤུལ་བཟང་པོར་བགྱི་ལགས་ན་ཕ་བོང་འདི་དོར་བར་རྔོ་མ་ཐོག་གོ།
en: “We are cleaning up the road for the Blessed One, but we cannot remove this huge rock.”

source: །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། གལ་ཏེ་དེ་ལྟ་ན་ངས་དོར་རམ།
en: “In that case, shall I remove it?” asked he Blessed One.

source: བཅོམ་ལྡན་འདས་དོར་དུ་གསོལ།
en: “O Blessed One, please remove it.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་གཡས་པའི་མཐེ་བོས་ཕ་བོང་སྟེང་གི་ནམ་མཁའ་ལ་འཕངས་ཏེ་མིག་རྒྱང་གིས་ཀྱང་མི་སོད་པར་བོར་བ་དང་དེའི་སྒྲས་གྱད་རྣམས་སྔངས་པར་གྱུར་ཏོ།
en: Then the Blessed One lifted the huge rock into the air using his right big toe. When he threw it up and out of sight, the people of the Malla clan were frightened at the sound it caused.

source: །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: The Blessed One said, “Vāsiṣṭhas, do not be frightened.”

source: གནས་འཇོག་དག་མ་འཇིགས་ཤིག །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱི་རྫུ་འཕྲུལ་གྱི་སྟོབས་ཀྱིས་ཕ་བོང་དེ་ཕྱེ་མར་བརླགས་ནས་རྡུལ་འབབ་པར་བརྩམས་སོ།
en: Then the Blessed One smashed the rock into pieces with his power of meditation, and dust fell all around.

source: །གྱད་རྣམས་ཀྱིས་གསོལ་པ། བཅོམ་ལྡན་འདས་རྡུལ་ག་ལས་འབབ་ལགས།
en: The people of the Malla clan asked, “O Blessed One, where does this dust fall from?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། དེ་བཞིན་གཤེགས་པས་ཕ་བོང་དེ་ཕྱེ་མར་བརླགས་པ་ཡིན་ནོ།
en: “The Tathāgata smashed the rock into pieces,” replied the Blessed One.

source: །བཅོམ་ལྡན་འདས་ལ་ལེགས་པ་ཞིག་བགྱིས་སོ།
en: “It isn’t good that the Blessed One did that.”
